Transmitter/src/Catalogs/ExternalRequestHandlers/ExternalRequestHandlers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExternalRequestHandlers</name>
  <attributes>
    <name>ProjectURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SecretToken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>EventsHistory</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Action</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Level</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Event</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>HTTPStatusCode</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DataPresentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ApplicationPresentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UserName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Transmitter/src/Catalogs/ExternalRequestHandlers/ObjectModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Тогда

#Region Public

// LoadEventsHistory loads the event log data to the event handler's tabular section.
// 
// Parameters:
// 	StartDate - Date - start date of events;
// 	EndDate - Date - end date of events;
//
Procedure LoadEventsHistory( Val StartDate, Val EndDate ) Export
	
	Var Filter;
	Var NewEvent;

	Filter = New Structure();
	Filter.Insert( "StartDate", StartDate );
	Filter.Insert( "EndDate", EndDate );
	
	Events = Logs.GetEventsHistory( ThisObject.Metadata().Synonym, Filter );
	
	EventsHistory.Clear();
	
	For Each Event In Events Do
		
		If NOT ( Event.Data = Undefined OR Event.Data = Ref ) Then
			
			Continue;
			
		EndIf;
		
		NewEvent = EventsHistory.Add();
		FillPropertyValues( NewEvent, Event );
			
	EndDo;

	Write();
	
EndProcedure

#EndRegion

#Region EventHandlers

Procedure BeforeWrite( Cancel )
	
	Var Items;
	
	If ( Cancel OR DataExchange.Load ) Then
		
		Return;

	EndIf;
	
	Items = Catalogs.ExternalRequestHandlers.FindByURL( ProjectURL );
	
	For Each Item In Items Do
		
		If ( Ref = Item.Ref ) Then

			Continue;
			
		EndIf;
		
		Cancel = True;
		
		Return;
		
	EndDo;

EndProcedure

#EndRegion

#EndIf
